{
  "Fácil": [
    {"en": "Hello!", "pt": "Olá!"},
    {"en": "Good morning.", "pt": "Bom dia."},
    {"en": "How are you?", "pt": "Como você está?"},
    {"en": "I am fine, thank you.", "pt": "Estou bem, obrigado."},
    {"en": "What is your name?", "pt": "Qual é o seu nome?"},
    {"en": "My name is John.", "pt": "Meu nome é John."},
    {"en": "Where is the bathroom?", "pt": "Onde fica o banheiro?"},
    {"en": "I need help.", "pt": "Eu preciso de ajuda."},
    {"en": "How much does it cost?", "pt": "Quanto custa?"},
    {"en": "I like pizza.", "pt": "Eu gosto de pizza."},
    {"en": "Can you speak slowly?", "pt": "Você pode falar devagar?"},
    {"en": "I am learning English.", "pt": "Estou aprendendo inglês."},
    {"en": "I don’t understand.", "pt": "Eu não entendo."},
    {"en": "Please repeat.", "pt": "Por favor, repita."},
    {"en": "Thank you very much.", "pt": "Muito obrigado."},
    {"en": "Excuse me.", "pt": "Com licença."},
    {"en": "Goodbye!", "pt": "Adeus!"},
    {"en": "See you later.", "pt": "Até mais."},
    {"en": "I am hungry.", "pt": "Estou com fome."},
    {"en": "I am thirsty.", "pt": "Estou com sede."}
  ],
  "Médio": [
    {"en": "Can you help me find the station?", "pt": "Você pode me ajudar a encontrar a estação?"},
    {"en": "I have been studying English for two years.", "pt": "Eu estudo inglês há dois anos."},
    {"en": "Could you please explain this to me?", "pt": "Você poderia me explicar isso, por favor?"},
    {"en": "I would like to make a reservation.", "pt": "Eu gostaria de fazer uma reserva."},
    {"en": "What time does the train arrive?", "pt": "A que horas chega o trem?"},
    {"en": "I am looking for a job.", "pt": "Estou procurando um emprego."},
    {"en": "She is very good at playing the piano.", "pt": "Ela é muito boa em tocar piano."},
    {"en": "I have never been to New York.", "pt": "Eu nunca estive em Nova York."},
    {"en": "Can you recommend a good restaurant?", "pt": "Você pode recomendar um bom restaurante?"},
    {"en": "I will call you later.", "pt": "Eu vou te ligar mais tarde."},
    {"en": "We should meet to discuss the project.", "pt": "Nós devemos nos encontrar para discutir o projeto."},
    {"en": "I prefer coffee over tea.", "pt": "Eu prefiro café a chá."},
    {"en": "He is responsible for the marketing team.", "pt": "Ele é responsável pela equipe de marketing."},
    {"en": "I am interested in learning new skills.", "pt": "Estou interessado em aprender novas habilidades."},
    {"en": "It is important to save money for the future.", "pt": "É importante economizar dinheiro para o futuro."},
    {"en": "She is planning to travel next month.", "pt": "Ela está planejando viajar no próximo mês."},
    {"en": "I will finish this task by tomorrow.", "pt": "Eu vou terminar esta tarefa até amanhã."},
    {"en": "Can you explain the rules again?", "pt": "Você pode explicar as regras novamente?"},
    {"en": "I need to buy a gift for my friend.", "pt": "Eu preciso comprar um presente para meu amigo."},
    {"en": "We are waiting for the manager to arrive.", "pt": "Estamos esperando o gerente chegar."}
  ],
  "Difícil": [
    {"en": "Despite the rain, we decided to continue our journey.", "pt": "Apesar da chuva, decidimos continuar nossa viagem."},
    {"en": "He took the initiative to lead the team successfully.", "pt": "Ele tomou a iniciativa de liderar a equipe com sucesso."},
    {"en": "I can’t help but notice the subtle differences in their approach.", "pt": "Não consigo deixar de notar as sutis diferenças na abordagem deles."},
    {"en": "The proposal sparked a heated debate among the participants.", "pt": "A proposta gerou um debate acalorado entre os participantes."},
    {"en": "She managed to overcome all obstacles and achieve her goals.", "pt": "Ela conseguiu superar todos os obstáculos e alcançar seus objetivos."},
    {"en": "I was taken aback by the unexpected results.", "pt": "Fiquei surpreso com os resultados inesperados."},
    {"en": "They decided to postpone the meeting until further notice.", "pt": "Eles decidiram adiar a reunião até novo aviso."},
    {"en": "He has a knack for solving complex problems efficiently.", "pt": "Ele tem um talento para resolver problemas complexos de forma eficiente."},
    {"en": "The committee is deliberating on the proposed regulations.", "pt": "O comitê está deliberando sobre as regulamentações propostas."},
    {"en": "She expressed her opinion candidly during the conference.", "pt": "Ela expressou sua opinião francamente durante a conferência."},
    {"en": "It is crucial to weigh all options before making a decision.", "pt": "É crucial considerar todas as opções antes de tomar uma decisão."},
    {"en": "He tends to procrastinate when facing challenging tasks.", "pt": "Ele tende a procrastinar ao enfrentar tarefas desafiadoras."},
    {"en": "The report provides a comprehensive analysis of market trends.", "pt": "O relatório fornece uma análise abrangente das tendências do mercado."},
    {"en": "I find it hard to reconcile work and personal life sometimes.", "pt": "Às vezes, acho difícil conciliar trabalho e vida pessoal."},
    {"en": "She has been advocating for environmental protection for years.", "pt": "Ela tem defendido a proteção ambiental há anos."},
    {"en": "The new policy aims to streamline administrative procedures.", "pt": "A nova política visa simplificar os procedimentos administrativos."},
    {"en": "He spoke eloquently about the importance of teamwork.", "pt": "Ele falou de forma eloquente sobre a importância do trabalho em equipe."},
    {"en": "I am looking forward to the conference next month.", "pt": "Estou ansioso para a conferência do próximo mês."},
    {"en": "They implemented a strategy to boost company productivity.", "pt": "Eles implementaram uma estratégia para aumentar a produtividade da empresa."},
    {"en": "Understanding cultural differences is essential in international business.", "pt": "Compreender as diferenças culturais é essencial nos negócios internacionais."}
  ]
}
